; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	spectrograph1 - mode
	image6 - mode
	image2 - mode
	thermograph3 - mode
	spectrograph4 - mode
	image5 - mode
	thermograph0 - mode
	Star0 - direction
	GroundStation1 - direction
	Star2 - direction
	Star3 - direction
	Star5 - direction
	GroundStation6 - direction
	GroundStation7 - direction
	Star9 - direction
	Star4 - direction
	GroundStation8 - direction
	Planet10 - direction
	Planet11 - direction
	Star12 - direction
	Planet13 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
)
(:init
	(supports instrument0 image2)
	(supports instrument0 image6)
	(supports instrument0 thermograph3)
	(supports instrument0 thermograph0)
	(supports instrument0 image5)
	(supports instrument0 spectrograph4)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 GroundStation8)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star9)
)
(:goal (and
	(pointing satellite0 Star4)
	(have_image Planet10 image2)
	(have_image Planet10 spectrograph4)
	(have_image Planet11 thermograph0)
	(have_image Planet11 spectrograph1)
	(have_image Star12 thermograph0)
	(have_image Star12 image6)
	(have_image Planet13 thermograph0)
	(have_image Planet13 image5)
	(have_image Phenomenon14 thermograph0)
	(have_image Phenomenon15 image6)
))

)

; plan
1. (turn_to satellite0 groundstation8 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 groundstation8)
   goals met: 0 of 11
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 11
3. (calibrate satellite0 instrument0 groundstation8)
   added: (calibrated instrument0)
   goals met: 0 of 11
4. (turn_to satellite0 planet13 groundstation8)
   deleted: (pointing satellite0 groundstation8)
   added: (pointing satellite0 planet13)
   goals met: 0 of 11
5. (take_image satellite0 planet13 instrument0 thermograph0)
   added: (have_image planet13 thermograph0)
   goals met: 1 of 11
6. (take_image satellite0 planet13 instrument0 image5)
   added: (have_image planet13 image5)
   goals met: 2 of 11
7. (turn_to satellite0 planet11 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet11)
   goals met: 2 of 11
8. (take_image satellite0 planet11 instrument0 thermograph0)
   added: (have_image planet11 thermograph0)
   goals met: 3 of 11
9. (take_image satellite0 planet11 instrument0 spectrograph1)
   added: (have_image planet11 spectrograph1)
   goals met: 4 of 11
10. (turn_to satellite0 planet10 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet10)
   goals met: 4 of 11
11. (take_image satellite0 planet10 instrument0 spectrograph4)
   added: (have_image planet10 spectrograph4)
   goals met: 5 of 11
12. (take_image satellite0 planet10 instrument0 image2)
   added: (have_image planet10 image2)
   goals met: 6 of 11
13. (turn_to satellite0 phenomenon14 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon14)
   goals met: 6 of 11
14. (take_image satellite0 phenomenon14 instrument0 thermograph0)
   added: (have_image phenomenon14 thermograph0)
   goals met: 7 of 11
15. (turn_to satellite0 phenomenon15 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon15)
   goals met: 7 of 11
16. (take_image satellite0 phenomenon15 instrument0 image6)
   added: (have_image phenomenon15 image6)
   goals met: 8 of 11
17. (turn_to satellite0 star12 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 star12)
   goals met: 8 of 11
18. (take_image satellite0 star12 instrument0 image6)
   added: (have_image star12 image6)
   goals met: 9 of 11
19. (take_image satellite0 star12 instrument0 thermograph0)
   added: (have_image star12 thermograph0)
   goals met: 10 of 11
20. (turn_to satellite0 star4 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star4)
   goals met: 11 of 11
